---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.MismatchedSystemClassificationHasSystemWarning
source: html/c05a100e-7f4b-bcb8-72bd-58d71e5fbd5e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.MismatchedSystemClassificationHasSystemWarning Property

The selected fixture is part of a system with different classification. System calculations (e.g. flow analysis) are not possible between systems with different classifications.

## Syntax (C#)
```csharp
public static FailureDefinitionId MismatchedSystemClassificationHasSystemWarning { get; }
```